{
  "version" : "7",
  "Stories": [
    {
      "title": "Flickering Lights",
      "tags": ["#prison"],
      "difficulty": 5,
      "description": "A man in a blue suit is running through a corridor clutching a briefcase Suddenly he sees the lights flicker and he stops running. Why?",
      "solution": "The man is a lawyer and he has received a last-minute pardon for his client on death row. When he sees the light flicker, he knows that he is too late and that his client has already been executed via electric chair."
    },
    {
      "title": "Barkeeper's Gun",
      "tags": ["#bar","#gun","#riddle","#classic"],
      "difficulty": 5,
      "description": "A man took a seat at the bar and asked the barkeeper for a glass of water. After giving the man his water, the barkeeper pulled out a gun from under the counter and pointed it at the man's head. The man never drank his glass of water. He thanked the barkeeper and left.",
      "solution": "The man had the hiccups. He ordered some water to try get rid of his hiccups. The barkeeper noticed him hiccuping and tried to frighten him by pointing a gun at his head. The surprise and shock cured the man's hiccups  hiccups so the water was no longer necessary."
    },
    {
      "title": "Interrupting a funeral",
      "tags": ["#hospital","#police","#death"],
      "difficulty": 4,
      "description": "George was at home when all of a sudden, he started to feel weak. His daughters called the emergency services and an ambulance arrived soon to take him to the hospital. George died as he was being carried into the hospital. At his funeral the family were comforted by how relaxed and calm he looked in death. While his family was gathered around his coffin, police entered the funeral home and arrested the funeral director.",
      "solution": "The funeral director wanted more business for his funeral home so he paid the ambulance workers to kill any elderly patients that availed of their services. They did so by administering a lethal dose of muscle relaxant to the patients. George was one of many victims and the police had finally gathered enough evidence to arrest the funeral director so they arrested him as soon as they could."
    },
    {
      "title": "Wedding murder",
      "tags": ["#murder","#jail","#alibi","#summer"],
      "difficulty": 3,
      "description": "On a very windy summers day in 2015, Helen was found dead in her back garden with a bullet wound on her head. Her uncle Nick was arrested for causing her death. Nick had a strong alibi as he was attending the wedding of his good friend John on the other side of town but he was found guilty nonetheless.",
      "solution": "Nick was the best man at John wedding in a small town in South Aegean. After the vows had been made, Nick fired some celebratory shots in the air with his hunting rifle. One of the bullets fell from the sky and, carried further by the wind, hit Helen in her head, killing her instantly. Thus, Nick was arrested and found guilty of manslaughter"
    },
    {
      "title": "Hit-and-run",
      "tags": ["#car-accident","#police","#alibi"],
      "difficulty": 3,
      "description": "There was a fatal hit-and-run in 2018 caused by a speeding car. There were two witnesses and both said that the car was a specific BMW model and had \"GR\" on the license plate. The police could now narrow the search down to the country of Greece and with further information provided by the witnesses, they could then narrow their search down to one suspect. However, the suspect had a strong alibi of where he was that day and he couldn't have committed the crime.",
      "solution": "The witnesses were identical twins who were both colour blind. They had mistakenly reported the car as being blue when it was actually green. There was only one blue car that matched the make and model reported by the brothers registered in Greece in 2018. That car was still registered to its original owner so the police assumed that it must be him."
    },
    {
      "title": "Bedtime Story",
      "tags": ["#riddle","#family"],
      "difficulty": 2,
      "description": "Nick keeps reading a bedtime story to his daughter despite the blackout.",
      "solution": "Nick is blind. The bedtime stories Nick usually reads for his daughter are from a braille book, thus the blackout that night didn't stop him from reading the story to his daughter."
    },
    {
      "title": "Death from just a cold",
      "tags": ["#death"],
      "difficulty": 3,
      "description": "Mathew could never have imagined his cold would cause his life to end",
      "solution": "Mathew forgot the gas on, thus his house began to fill with it. Since he had a cold, he couldn't smell the gas. Later when he started cooking, his house exploded from all the gas that had been leaking for hours."
    },
    {
      "title": "New pair of shoes",
      "tags": ["#death"],
      "difficulty": 4,
      "description": "A woman buys a new pair of shoes, goes to work, and dies.",
      "solution": "The woman is the assistant of a circus knife-thrower, and stands in front of a target as knives are thrown around her. The new shoes have higher heels than she normally wears, causing the thrower to misjudge his aim, thus killing her."
    },
    {
      "title": "Bob and Sandra",
      "tags": ["#death"],
      "difficulty": 3,
      "description": "Bob and Sandra were found lying dead on the floor. There was broken glass and a puddle of water on the floor next to them. How did they find their demise?",
      "solution": "Bob and Sandra were goldfish in a small aquarium on top a shelf. One day, their owner forgot the windows open near that self, and when a strong gust of wind blew, it knocked the window pane onto the shelf, thus knocking the small aquarium down the floor."
    },
    {
      "title": "11th Floor",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": "A woman lives on the 11th floor of an apartment. Every morning she takes the elevator to go to the ground floor, on her way to work. When she eventually returns home, she takes the elevator to the 6th floor and goes up the stairs for the remaining 5 floors.",
      "solution": "The woman is a dwarf, in the morning as she takes the elevator to go to work, she can easily press the ground floor button from the elevator's keypad, since that button is lower to the ground. On the other hand, when she returns from work, she can only reach up to the 6th button, thus having to go up the stairs the rest of the way up to her flat."
    },
    {
      "title": "Don't turn off the lights",
      "tags": ["#classic","#suicide"],
      "difficulty": 3,
      "description": "In the middle of the night a man woke up feeling thirsty. He drank some water and as he went back to sleep, he turned off all the lights. The next day as he woke up, he took a look outside of his window, yelled in dismay and later that day committed suicide.",
      "solution": "The man was a lighthouse keeper. That night, when he turned all the lights off, he also accidentally turned the lighthouse lamp off, thus causing several shipwrecks that night, realizing what he has done, he committed suicide."
    },
    {
      "title": "Saved by the airplane",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": "Samantha never thought that her decision to travel by plane would save her life.",
      "solution": "A few days earlier Samantha had an operation. Before boarding the plane, she had to go through the metal detector, which kept going off, despite the fact that she had removed everything metal she had on her. After an X-ray examination, it was discovered that the doctors had left a scalpel inside her body. If Samantha had not discovered it in time, she would have died sooner or later from infection."
    },
    {
      "title": "A hug can hurt?",
      "tags": ["#death"],
      "difficulty": 3,
      "description": "When John tried to hug someone, he died by drowning.",
      "solution": "John was very drunk, as he was walking next to a river; he saw his reflection in the water. As he was intoxicated and couldn't think clearly, he went to hug that \"someone\" and subsequently fell in the river and died of drowning."
    },
    {
      "title": "Black Cat",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A black cat is walking through the middle of a road where the streetlights are busted. A man is driving his vehicle with broken headlights. Despite all of this, he is able to avoid harming the cat.",
      "solution": "The man avoided the cat because it was broad daylight."
    },
    {
      "title": "Hunting",
      "tags": ["#death","#gun"],
      "difficulty": 3,
      "description": "A hunter aimed his gun at a deer and took the shot. After several seconds, he realized his mistake. Hours later, he was found dead.",
      "solution": "The hunter went hunting in snow-capped mountains. The sound from shot caused an avalanche, which enveloped the hunter. He died of asphyxiation."
    },
    {
      "title": "Through the window",
      "tags": ["#murder","#death"],
      "difficulty": 2,
      "description": "A woman is looking through the window and sees a man with a gun. However, she does not have enough time to call the police before she is murdered.",
      "solution": "The woman saw the reflection of the murderer who was behind her and already inside her house."
    },
    {
      "title": "Listening to the radio",
      "tags": ["#suicide","#death"],
      "difficulty": 5,
      "description": "A woman is driving down a highway listening to the radio. Suddenly the radio station she was listening goes silent. As she passes by a bridge on the highway, she decides to throw herself off the bridge to end her life, why?",
      "solution": "The woman in question was a radio broadcaster who had committed murder prior that day. She had left a pre-recorded segment to play on the radio broadcast as if it was a live segment planning to use that as her alibi. As soon as the radio broadcast went silent due to some technical error, she realised that she couldn't use this an alibi, thus deciding to end her life."
    },
    {
      "title": "Explosions",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A woman is watching TV. Suddenly she hears a series of explosions and people screaming outside. After several minutes there is complete silence. The woman turns off the TV and goes to sleep.",
      "solution": "It was New Year's Eve. The woman waited patiently until the end of the celebrations and eventually went to bed."
    },
    {
      "title": "The locked door",
      "tags": ["#family","#riddle"],
      "difficulty": 4,
      "description": "A little girl was warned by her parents never to open the cellar door. If she did, she would see things that they did not want her to see. One day, her parents left the house and accidentally forgot to lock the cellar door. The girl took that opportunity and opened the cellar door. What did she see?",
      "solution": "When the girl opened the cellar door, she saw the rest of the house she was living under all this time. She had never been outside the cellar as her parents had kept her there all her life."
    },
    {
      "title": "Unexpected bird",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "A man was watching outside a window. Out of nowhere he sees a bird flying. He then realizes that these would be his last moments alive.",
      "solution": "The man was onboard of an airplane, as he was watching outside the airplane window, he saw a bird getting sucked inside the right jet engine, thus causing a malfunction that would eventually lead to the plane crashing."
    },
    {
      "title": "Key tied to a cord",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "Every night before going to sleep, Natasha locks the door of her house and ties the key to a cord. Why?",
      "solution": "Natasha is a sleepwalker. For years now she sleepwalks in the middle of the night. One night she accidentally reached the front door, unlocked it and went outside. To prevent that event for ever happening, her husband proposed to tie the key to a cord attached to a bell, so that whenever she takes the key while sleepwalking, her husband would wake up and take her back to bed."
    },
    {
      "title": "Murder at Sea",
      "tags": ["#murder"],
      "difficulty": 5,
      "description": "A man was reading his morning newspaper as the headline \"Murdered at Sea\" piqued his interest. That moment he realizes who the culprit might be.",
      "solution": "The man was a travel agent. He had sold someone two tickets for an ocean voyage, one was for a round-trip and the other was one-way. The last name of the man who bought the tickets is the same as the last name of the woman who was murdered on the same voyage."
    },
    {
      "title": "Out of gas",
      "tags": ["#death","#family"],
      "difficulty": 2,
      "description": "A married couple were on a road trip in their sedan. Right before they reached their destination the sedan run out of gas. The man, leaving his wife inside the car, closed the windows, locked the doors and exited the vehicle and went to get help. Upon returning, he found his wife lying dead inside the car and a stranger next to her. The doors and the windows were locked and closed, the car intact, what happened?",
      "solution": "The woman had given birth, and subsequently bled to death. Since the father had never seen the baby before, it could technically be called a stranger."
    },
    {
      "title": "Don't look at the light!",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "Adam saw the light and became paralyzed. Several seconds later he died.",
      "solution": "Adam was a rabbit. One fateful night, the owner forgot to lock his cage, and the rabbit escaped. As it was about to cross the road, a car blinded it and ran it over."
    },
    {
      "title": "Lost on a trip",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "Dimitri went on a trip carrying his compass. After a long hike, he stopped to have lunch. After that he wasn't able to find his way back. Why?",
      "solution": "Dimitri was a researcher who worked at the North Pole. He went hiking towards the north and, without him realising it, he reached the Northernmost point, ate his lunch there and then tried to return back. The compass at that point could only point at one direction only, the South."
    },
    {
      "title": "Book of Desperation",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": "A woman went to the local library, took a book from a bookshelf and cried out in desperation, why?",
      "solution": "The woman was the writer of that particular book. She donated that book to the library last year. Before donating it, she placed a 50€ bill near the last chapter, as a \"thank you for reading\" for the first reader. Unfortunately, the bill was still there a year later. Realizing no one had read her book, she cried out of desperation."
    },
    {
      "title": "Prison break",
      "tags": ["#prison","#riddle"],
      "difficulty": 2,
      "description": "Daniel is in prison. One day, he had lunch, went to the prison courtyard for several hours and finally visited the library. At dusk, without the security cameras watching him, he changed his clothes. He then went through the front door left the prison, and didn't get caught. How?",
      "solution": "Daniel was a prison guard, finished his shift and went home."
    },
    {
      "title": "Famous Drink",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "A woman was invited to a party where a very famous drink would be served. She drank that very famous drink and left. Everyone else who drank that very same drink , died of poisoning. How come the woman didn't die?",
      "solution": "While she did drink the very same drink, the poison wasn't in the mixture of the drink but rather in the ice cubes of the drink. She didn't die because she drank it quickly, not letting the ice cubes melt, while the others at the party did not, thus the ice cubes melted and the poison was released in the drink."
    },
    {
      "title": "Heart attack at work",
      "tags": ["#death"],
      "difficulty": 3,
      "description": "Michael died of a heart attack while at work. His colleagues however did not call an ambulance despite being next to him and watching him fall to the ground. Eventually Michael died, why did they not call for an ambulance?",
      "solution": "Michael was an actor playing his role. He was playing someone who was having a heart attack. Thus, his colleagues thought that he was just doing his act exceptionally, only to realize several minutes later that is wasn't simply an act."
    },
    {
      "title": "A special private session",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "An exotic model goes in a room for a private session with a man. In that session she takes off her shirt and bra, while the man watches. The man then approaches, watches her breasts and smiles. After that she dresses herself up, pays the man and leaves.",
      "solution": "The woman had undergone a breast enlargement surgery several days earlier and she had arranged an appointment with her private doctor to review the results of the operation. The doctor checked that everything went according to plan and got paid by his customer."
    },
    {
      "title": "Wrong Turn",
      "tags": ["#car-accident"],
      "difficulty": 4,
      "description": "A driver accidentally crashed into a motorcycle, as the car was making a questionable turn at an interchange. When the police arrived to the scene, the passenger got arrested instead of the driver, why?",
      "solution": "The passenger was a driving instructor on a lesson with the driver. The instructor did not pay enough attention to the road and instructed the driver to make a turn, only to hit the motorcyclist. Thus, the police arresting the instructor but not the driver."
    },
    {
      "title": "Safe Shoe",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": "Each night before the woman goes to sleep, she hides her shoe in a safe, why?",
      "solution": "The woman is an air hostess. Whenever she sleeps in a hotel (after finishing for the day) she places her documents in the safe. In order for her not to forget them she also puts inside one of her shoes so that when she wakes ups she has to open the safe."
    },
    {
      "title": "Levitating Woman",
      "tags": ["#death","#suicide"],
      "difficulty": 2,
      "description": "A woman was found dead hanging from the ceiling in an empty, locked room with a puddle of water underneath her.",
      "solution": "She stoop on top of a big ice cube to hang herself, after the ice cube melted, she left her last breath."
    },
    {
      "title": "Narcos",
      "tags": ["#riddle","#police"],
      "difficulty": 5,
      "description": "The Colombian police made several attempts to arrest a well-known drug cartel leader. They knew every move he made. Finally, after they issued an arrest warrant, they began to approach his house. Eventually when they entered the house, he was locked inside the room furthest back in the house. For some reason the police couldn't arrest him, why?",
      "solution": "The drug lord has built his house in such a way that the front of his house would be inside the border of Colombia and the back of his house would be inside the border of Ecuador, thus the police could not arrest him, because they would break international law since Ecuador isn't in their jurisdiction."
    },
    {
      "title": "Cactus",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "A woman walks aimlessly in a desert; in the distance she notices a cactus with a small piece of paper stuck to it. When she moves closer to it, she realizes that nothing is written on the paper. She lies down and slowly dies.",
      "solution": "That blank paper was hers, she put it there as a checkpoint to mark where she had already been. Unfortunately for her, she was going in circles and not making any progress in finding her way back."
    },
    {
      "title": "Windy Night",
      "tags": ["#death"],
      "difficulty": 4,
      "description": "Nicky would still be alive if it wasn't windy that night.",
      "solution": "Nicky decided it was a good idea to fly her kite in the middle of the night despite the wind. At some point she lost control of it and the kite got tangled in a nearby transmission tower, thus electrocuting Nicky."
    },
    {
      "title": "The lost treasure",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "George dug a hole and in it hid a treasure, unfortunately when he eventually wanted to recover it, he couldn't find it.",
      "solution": "When George was a child, he hid that treasure and measured the distance with his own feet from a nearby landmark. Now that he went to recover it his feet grew bigger and the measurement he made as a child cannot add up."
    },
    {
      "title": "Boiled in the Sea",
      "tags": ["#death"],
      "difficulty": 4,
      "description": "Martha was in a diving expedition that day. How come they found her burned to a crisp?",
      "solution": "Martha was indeed scuba diving that fateful day. As she went towards the surface, a firefighting plane refilled its water reserves, picking up Martha as well by accident. When eventually the plane went to extinguish the forest fires, both the water and Martha were thrown in the fire."
    },
    {
      "title": "Unsolved Murder",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "Rick was about to find who was the murderer, but fell asleep. When he eventually woke up, he could no longer find who the murderer was.",
      "solution": "Rick was reading a detective novel while sunbathing on the beach. As he was about to read who committed the murder, he fell asleep and left the book on the sand As the tides rose, they swept the book without him realising. When he woke up, his book was gone for good."
    },
    {
      "title": "Feather duster",
      "tags": ["#death"],
      "difficulty": 3,
      "description": "There's a corpse next to a feather duster. How did it come to be there?",
      "solution": "The corpse was a carnival sword swallower. During a practise session, someone tickled him with the duster as a prank, causing him to laugh and ruin his trick, causing his demise."
    },
    {
      "title": "Scissors of death",
      "tags": ["#hospital","#death"],
      "difficulty": 3,
      "description": "An old man is found dead on a hospital bed. There are no injuries or cuts on his body. The police take in a pair of scissors as the murder weapon.",
      "solution": "The man had just suffered heart failure and was kept alive through machinery. The murderer cut the machines wire with a pair of scissors thus causing the man's death indirectly."
    },
    {
      "title": "Hand delivered",
      "tags": ["#riddle"],
      "difficulty": 5,
      "description": "A man receives a package. Inside it he finds a human arm. Unfazed he repackages it and sends it to a friend of his. His friend receives it, looks at it carefully and then cuts it up and feeds it to his pigs. Why did any of this occur?",
      "solution": "Three men survived a plane crash. When they run out of food, they made a pact they would cut of their left arms each day to feed themselves. However, they were rescued after 2 days so the third man didn't cut off his arm. Unwilling to break his promise, he cut off his arm later and sent it to his comrades to show them he did not forget their pact."
    },
    {
      "title": "Perfect class",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A local administrator was making the rounds at a school. While observing a class, he noticed that when the teacher asked a question, all the students raised their arms, but the student the teacher selected always knew the correct answer",
      "solution": "The teacher instructed the students to raise their left arm if they didn't know the answer and their right if they did. Thus, the teacher could choose someone who knew the correct answer while also having an idea of how many kids didn't so she could help them catch up later."
    },
    {
      "title": "Frightened to death",
      "tags": ["#death"],
      "difficulty": 5,
      "description": "A woman opened her eyes, lit a match saw nothing and died of fright.",
      "solution": "The woman was a prisoner and had come up with a plan with the prison mortician to escape. When the next prisoner died, she would be put in the coffin with them and then when said coffin would be transported towards the graveyard, the mortician would open it and she’d escape. However, something went wrong and she was buried together with the corpse Thus when she woke up, she saw nothing, realised she was buried alive and died of fright."
    },
    {
      "title": "The Myna",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A man walks goes to an exotic pet store to buy a myna bird. The owner sells her one, saying it can repeat everything it hears. However, the woman discovers the bird does no such thing. When she goes to return citing false advertising, she fails.",
      "solution": "The Myna was deaf, so as it couldn't hear anything it couldn't repeat anything. Since he never technically lied, the owner refused to take the bird back."
    },
    {
      "title": "No lights no life",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "A woman was going down the stairs while at work. Suddenly she was plunged into total darkness. At that moment she knew for certain her husband was dead.",
      "solution": "The woman was an electrician at a hospital where the emergency power was malfunctioning. Coincidentally her husband was also at that hospital, connected to assisted living machinery as he had been in an accident earlier that day. The moment the woman realised there was a blackout since the lights went off, she knew her husband would die."
    },
    {
      "title": "Dead watch",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "Tim was on his boat when his watch fell in the water, and despite him being an excellent swimmer he could not retrieve it.",
      "solution": "Tim was sailing on the dead sea, and couldn't swim due to its high salinity so he couldn't recover his watch."
    },
    {
      "title": "Half a euro is more than 10",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "people in a small mountain village often made fun of a local village idiot, who when given the choice between a 50-cent coin and a 10-euro bill, would always happily choose the 50-cent coin despite it being worth 20 times less. Why would he do that?",
      "solution": "The so called “idiot” knew that the moment he took the bill, people would stop mockingly offering him the choice between the coin and the bill."
    },
    {
      "title": "A silent call",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A man is unable to sleep. He makes a phone call, says nothing, and then goes immediately to sleep.",
      "solution": "The man is in a hotel room and the person in the next room is snoring so loud it can be heard through the walls. He calls the next room, thus waking the snorer, and proceeds to go to sleep as fast as he can mow that there's silence before the snorer can start snoring again."
    },
    {
      "title": "The match of death",
      "tags": ["#death"],
      "difficulty": 5,
      "description": "There is a naked corpse in the desert with a match in his hand. Next to it there are many sets of clothes as well as other items like suitcases food etc. Much further stands a man, alive,, also naked, also with a match in his hand?",
      "solution": "The men were flying a hot air balloon, when it was suddenly punctured and started losing altitude. They threw all they had including their clothes overboard, but the hot air balloon was still going down too fast. They then draw lots with matches to see who would jump, and the first man lost."
    },
    {
      "title": "Three times the robbery",
      "tags": ["#police","#riddle"],
      "difficulty": 5,
      "description": "A teen goes into a pharmacy and leaves with some money from the cash register. Later a policewoman finds him, takes the money back and tells the boy to get in her car. That night 3 people report a theft.",
      "solution": "The teen was the pharmacy owner's son, and his bike had been stolen earlier that day, so he went to his father's business to borrow some money to take the bus. Since his father had no coins on him, he gave him some change from the cash register. After his son left, he remembered his wife, a police officer, would be patrolling the area, so he phoned her and asked her to take their son where he needed to go. She then found the boy on the way to the bus stop, where he gave her the money he no longer needed and got in her car so they could go to his destination."
    },
    {
      "title": "The seagull",
      "tags": ["#classic","#suicide"],
      "difficulty": 5,
      "description": "A sun burned middle aged man enters a restaurant. He orders seagull and after he tastes it, he goes and jumps off a bridge. Why?",
      "solution": "He had recently been in a shipwreck on a deserted island, where a fellow survivor offered him some meat, promising it was from a seagull she had caught and not from the bodies of the passengers who didn't make it. Suspecting foul play, the man decided to try seagull after he was rescued to see if he had truly eaten seagull and not human meat. Knowing the true taste of seagull and unable to live with the idea he had eaten the flesh of another human being, he committed suicide."
    },
    {
      "title": "Millionaires",
      "tags": ["#riddle","#family"],
      "difficulty": 3,
      "description": "A couple got married. After the wedding, they stopped working or investing and just started spending money hand over fist. In three years, they were millionaires.",
      "solution": "Before the wedding, they used to be billionaires."
    },
    {
      "title": "Dying prematurely",
      "tags": ["#death"],
      "difficulty": 5,
      "description": "A man expected to die in a few months, dies in a few days. Why?",
      "solution": "The man who was dying was an organ donor, and a person eligible to receive the organs was found. A family member of the later kills the organ donor sooner fearing her relative couldn't survive long enough to get the organs otherwise."
    },
    {
      "title": "Taxi driver",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A woman enters a taxi and tells the driver where her house is so he can take her there. On the way she starts talking, but the driver cuts her off and tells her he is deaf. As they reach her home and she gets off, she realises the driver lied to her.",
      "solution": "How could the driver be deaf if he heard her address?"
    },
    {
      "title": "Hearing aid",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": " John forgot to wear his hearing day one day. Realising he could hear much better that way; he heads to his doctor ready to complain. Instead, his doctor ends up being angry with him. Why?",
      "solution": "John had been putting the hearing aid in the wrong ear."
    },
    {
      "title": "Sales demonstration",
      "tags": ["#death"],
      "difficulty": 3,
      "description": "A door to door salesman took pride in demonstrating his products. One day that led to his death.",
      "solution": "The salesman sold bulletproof vests, and asked his customers to shoot him. Unfortunately, one day one of them missed and shot him in the head."
    },
    {
      "title": "Three suspects",
      "tags": ["#death","#gun"],
      "difficulty": 1,
      "description": "A detective was walking down the street. Suddenly he heard someone yelling, “Don't shoot me bob I beg you!” from a nearby store. The detective bust into the shop only to find a dead woman and a smoking gun. In the store stood a postman, a doctor, and an accountant. The detective took one look at them and immediately arrested the postman. He was correct, but why?",
      "solution": "The post MAN was the only man."
    },
    {
      "title": "Four flat tires",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "Four students were late for a lecture with their excuse being a flat tire. The professor quickly proved to the rest of the students that the latecomers had lied. How?",
      "solution": "The professor asked them to leave the room. Then she told them to come back one by one and asked each which tire was flat. Naturally each had a different answer."
    },
    {
      "title": "A delayed death",
      "tags": ["#death"],
      "difficulty": 4,
      "description": "While Charlie was in the forest, an animal bit off his nose. But he only died 3 months later.",
      "solution": "Charlie was a snowman the local kids had built. A deer bit the carrot that was his nose, but Charlie “died” when he melted some months later."
    },
    {
      "title": "And he never saw her again",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "Sally was woken up by the dog, who brought her a letter. After she read it, she started crying, now knowing her husband would never see her again.",
      "solution": "Sally's husband was legally blind and had recently undergone an experimental surgery with the aim to improve his sight. His guide dog, who was left at home, brought sally the letter with the news that the surgery failed and her husband was now fully blind."
    },
    {
      "title": "Falling",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "He fell unconscious and silence reigned and a few seconds after she died.",
      "solution": "A rope dancer at a circus did a routine where she would perform tricks while blindfolded. She was to jump from the rope at a padded square after the music stopped. Unfortunately, that day the musician wasn't feeling well and suddenly lost consciousness, so when she inevitably jumped off the rope the rope dancer plunged to her death."
    },
    {
      "title": "Death in the shade",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "Some tourists find a corpse at the beach. The corpse was under an umbrella and had a knife on his back. However, there is no blood or signs of violence. The doctors conclude he died of natural causes.",
      "solution": "The knife was a tattoo. The man died of heart failure."
    },
    {
      "title": "Door to your death",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "When Martin woke up in the morning, He was surprised to find his front door wide open. The moment he went outside, he was killed.",
      "solution": "Martin was a canary, and his owner had forgotten his cage door open. The moment the little bird tried going outside, the cat who was waiting for exactly that day immediately ate him."
    },
    {
      "title": "Wrong colour",
      "tags": ["#death"],
      "difficulty": 4,
      "description": "Maria died because she got the colours wrong.",
      "solution": "Maria was bitten by an exotic snake. When asked what colour the snake that bit her was by the doctor trying to find the correct antivenom, she said the wrong colour as she was colourblind. The doctor then administered the wrong antivenom causing Marias death."
    },
    {
      "title": "A fratricide",
      "tags": ["#murder","#death"],
      "difficulty": 2,
      "description": "Jobe kills his brother in front of a crowd of people, yet no one reports him. How come?",
      "solution": "Jobe was an executioner and his brother was to be executed for his crimes."
    },
    {
      "title": "Audience's love",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "Jameel thought it was the best moment of his life. Seconds later he was killed.",
      "solution": "At the end of the play the lead actor appeared to thank the audience. In the same time a cable snapped and parts of the scenery started to fall. The audience rose and yelled to warm Jameel, but he thought he was receiving a standing ovation."
    },
    {
      "title": "Deadly clap",
      "tags": ["#riddle","#death"],
      "difficulty": 2,
      "description": "Bjork applauded, and everyone in the room but him was killed What happened?",
      "solution": "Bjork was killing mosquitoes."
    },
    {
      "title": "Call box surprise",
      "tags": ["#riddle","#police"],
      "difficulty": 3,
      "description": "Criminals kidnapped a little boy and asked his rich father to put an expensive ring in a call box in a public park. The father obeyed, but also notified the police. Despite the police surrounding the park, they neither caught the criminal nor did they recover the ring. How?",
      "solution": "When the father opened the call box, he found a pigeon with instructions to put the ring in a compartment on the bird's leg. Inevitably the police couldn't follow the pigeon. This is a real story that happened in Taiwan."
    },
    {
      "title": "Survivorship bias",
      "tags": ["#car-accident","#hospital"],
      "difficulty": 4,
      "description": "The number of deaths as a result of car crashes was very high, so the county decided to make seat belts mandatory. But that only increased the number of accidents and injured people.",
      "solution": "The adoption of seat belts decreased the number of deaths drastically. Naturally that meant that more people became injured instead of dying, and when they recovered had the chance to crash again instead of only once."
    },
    {
      "title": "A dress to die for",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "A woman finishes getting dressed and dies.",
      "solution": "There was a very venomous scorpion in her shoe. When she put on her shoes it stung her and she died."
    },
    {
      "title": "Follow up",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": " Byrne run out of a building while carrying a few bags. A different man ran after him, shouting and waving around knives.",
      "solution": "Byrne was shopping, and was eligible for a gift: a set of kitchen knife. As he was in a hurry, he forgot it at the counter and the clerk ran after him to return it to him."
    },
    {
      "title": "Breath of relief",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A man exits a house out of breath, closes the door and goes quickly down stairs. Then he walks a few blocks get to another house, goes in and breathes out relieved.",
      "solution": "The man was carrying his stuff over to his new house after his move, and let out a sigh of relief when he finally moved the last few boxes."
    },
    {
      "title": "Jump",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A man jumped out of plane and survived.",
      "solution": "The plane wasn't flying at the time."
    },
    {
      "title": "Deadly wallet",
      "tags": ["#death"],
      "difficulty": 5,
      "description": "The wallet Siobhan stole was her death?",
      "solution": "The wallet belong to a person who was against resuscitation, and had the relevant card in it. Thus, when Siobhan got in an accident, the paramedics did not resuscitate her and she died."
    },
    {
      "title": "A random murder",
      "tags": ["#police","#riddle"],
      "difficulty": 4,
      "description": "A man suddenly starts chocking a woman in the middle of the street. He is arrested but soon after he is released.",
      "solution": "The woman was his wife, who had some years earlier staged her death and pinned it on her husband. After he served his sentence, he killed her and couldn't be charged for it as he had already been charged for the same crime."
    },
    {
      "title": "Silent A",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": "Students are taking an exam. One of them takes his paper and goes to his seat. After a bit he goes to the professor, silently gives him the paper and leaves the classroom. He gets A+.",
      "solution": "It was a morse code exam and the professor was sending the message “the first student who comes to my desk will get an A+” by tapping his pen on his desk."
    },
    {
      "title": "Luck of the draw",
      "tags": ["#suicide"],
      "difficulty": 2,
      "description": "Peter wins the raffle. Minutes later he is dead.",
      "solution": "Peter and a group of people were trapped in a log cabin after an avalanche. After their provisions run out, they held a raffle to see who will be eaten first and Peter lost the raffle."
    },
    {
      "title": "Oh my windshield!",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A man Marks windshield. Although Mark was watching he made no attempt to stop him or call the police.",
      "solution": "Mark and the other man had a bet, and the winner would smash the looser’s windshield. Obviously, Mark lost."
    },
    {
      "title": "Multiplying calico",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A man goes to vacation and asks his friend to look after his cat. When he returns his friend greets him with 5 cats in tow.",
      "solution": "While the friend was looking after the cat, it ran away. The friend, not knowing the cat well, gathered all the neighbouring cats of a similar colour and waited for the owner to return to tell him which is his."
    },
    {
      "title": "Hanging out",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "Amara was walking along her property when she saw the corpse of a man dangling from a lone tree. He had died from strangulation but there were no footprints around except Amaras.",
      "solution": "The hanged man was a skydiver. When he was falling, his parachute got caught in the tree and strangled him."
    },
    {
      "title": "Apple in a bottle",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "How do you put a full-grown apple inside a bottle?",
      "solution": "The apple grows inside the bottle."
    },
    {
      "title": "How to outplay Tiger Woods?",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A man made a bet with Tiger Woods that he could beat him at golf, provided he chose the time and place. Woods agreed and subsequently lost.",
      "solution": "The person was blind and chose a moonless night to play against Tiger Woods. Being unused to playing golf in the dark, Tiger woods lost."
    },
    {
      "title": "Healthy patients",
      "tags": ["#hospital"],
      "difficulty": 2,
      "description": "When asked, a hospital director said most of his patients were perfectly healthy when admitted. How can that be?",
      "solution": "The hospital is a maternity hospital and his patients are just pregnant."
    },
    {
      "title": "Greenland",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": "Most of Greenland is covered in ice. Why then is it called Greenland?",
      "solution": "Erik the red, an ancient horseman explorer,  named it Greenland hopping to attract more settlers that way."
    },
    {
      "title": "Cash printer?",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A man made a device where you put coloured paper in one end and the perfect hundred-dollar bid comes out the other end. Experts agree that those bills are indistinguishable from real ones. He sold this device for a million dollars. How did he manage to build and sell such a device?",
      "solution": "The device removes recently added colour from paper. The man demonstrates this device by putting a painted real dollar bill in it. The result is indistinguishable from real money because it is real money. After they get fooled his clients cannot seek justice or recompense from the police. After all they were trying to purchase a counterfeiting machine."
    },
    {
      "title": "Uneeded cast",
      "tags": ["#riddle"],
      "difficulty": 5,
      "description": "Why did a young girl put a cast around her unbroken arm?",
      "solution": "She did so because she knew that in her school the teachers responsible for oral exams are less strict and put better grades than those for the written ones, so she put the cast on her arm hopping she would be allowed to take an oral exam."
    },
    {
      "title": "Killer communion",
      "tags": ["#death"],
      "difficulty": 2,
      "description": "When the friar stopped preaching, Bobby died.",
      "solution": "Bobby was a little hamster who escaped from his owner when the later took him with her to church. When the friar finished with his sermon, he headed towards the back to bring the wine and bread and stepped on little Bobby."
    },
    {
      "title": "The Train",
      "tags": ["#riddle"],
      "difficulty": 3,
      "description": "A man was walking along the rails when he noticed a train coming towards him. He then started running towards it.",
      "solution": "The man was in a tunnel and the nearest exit was towards the train. Knowing he wouldn't make it to the other exit, he started running towards the train, jumping off the rails at the nearest tunnel exit just in time."
    },
    {
      "title": "Mouse fraud",
      "tags": ["#riddle"],
      "difficulty": 4,
      "description": " Chung receives a parcel with a dead mouse in it. He reports this to the police and the sender is found guilty of fraud.",
      "solution": "The sender was supposed to send an expensive ring, but put in a mouse instead hoping it would chew a hole in the box and he could blame the post office."
    },
    {
      "title": "The Chase",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": "A man is running while a crowd is chasing him. The man suddenly screams to them: \"None of you will see the gold! \", picks up a rifle, and starts shooting. People observing them are all very excited.",
      "solution": "It was a biathlon competition."
    },
    {
      "title": "Winner or loser?",
      "tags": ["#riddle"],
      "difficulty": 2,
      "description": " Two men are fist fighting, when suddenly they both fall on the floor.",
      "solution": "The men are boxers. The mafia kidnapped the daughter of the one favoured to win in order to blackmail him into throwing the match, but he had to make it realistic. So, when his opponent unexpectedly fainted near the end of the match, the first man threw himself to the floor in order to hopefully lose the match."
    },
    {
      "title": "Unreliable reliable witness",
      "tags": ["#police"],
      "difficulty": 4,
      "description": "A plumber witnesses a kidnapping of a small child, but when he immediately reports it to the police, they do not believe him.",
      "solution": "The plumber had just left the dentist, who had put him under local anaesthesia. The police thought the man was drunk because his speech was slurred and didn't take him seriously."
    },
    {
      "title": "Doctor my doctor",
      "tags": ["#suicide"],
      "difficulty": 5,
      "description": "A woman goes to a doctor to get the results of some tests, which show no health issues. Regardless, she commits suicide soon after the visit.",
      "solution": "The woman was suspecting her wife was cheating on her, but she only knew her wife’s lover name. Her wife insisted she was innocent, but when the woman left the doctor's, she saw that name on the test results. Now having confirmation her wife was cheating on her, she committed suicide."
    },
    {
      "title": "The tell-tale tick",
      "tags": ["#death"],
      "difficulty": 4,
      "description": "Aaron returns home from his job tired, and goes to his bedroom to go to sleep. After some time, feeling uneasy and unable to sleep he turns on the lights and looks around. After seeing nothing out of the ordinary, he turns off the lights and tries to go to sleep. After doing this several times, he looks under the bed and discovers a corpse.",
      "solution": "A thief had entered Aaron’s home, and when Aaron returned, he hid under the bed. After some time, the tension became too much for the thief and he had a heart attack. Paul couldn't sleep because of the ticking from the thief's wristwatch."
    }
  ],
  "all_tags":
  [
    "#prison",
    "#bar",
    "#gun",
    "#winter",
    "#summer",
    "#spring",
    "#autumn",
    "#police",
    "#classic",
    "#car-accident",
    "#alibi",
    "#death",
    "#suicide",
    "#murder",
    "#jail",
    "#wedding",
    "#hospital",
    "#family",
    "#riddle"
  ]
}

